UKS/src/InformationRegisters/ЖурналОтпечатаныхЛистов/ЖурналОтпечатаныхЛистов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналОтпечатаныхЛистов</name>
  <comment>Журнал отпечатаных листов</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>КоличествоОтпечатанных</name>
    <comment>Количество</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РазмерЛиста</name>
    <comment>Размер листа</comment>
    <type>
      <types>EnumRef.РазмерыЛиста</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЦветПечати</name>
    <type>
      <types>EnumRef.ЦветПечати</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UKS/src/Enums/ЦветПечати/ЦветПечати.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЦветПечати</name>
  <comment>Цвет печати</comment>
  <enumValues>
    <name>ЧерноБелый</name>
    <comment>Черно-белый</comment>
  </enumValues>
  <enumValues>
    <name>Цветной</name>
    <comment>Цветной</comment>
  </enumValues>
</mdclass:Enum>

UKS/src/Enums/РазмерыЛиста/РазмерыЛиста.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РазмерыЛиста</name>
  <comment>РазмерыЛиста</comment>
  <enumValues>
    <name>А0</name>
    <comment>841×1189 (мм)</comment>
  </enumValues>
  <enumValues>
    <name>А1</name>
    <comment>594×841 (мм)</comment>
  </enumValues>
  <enumValues>
    <name>А2</name>
    <comment>420×594 (мм)</comment>
  </enumValues>
  <enumValues>
    <name>А3</name>
    <comment>297×420 (мм)</comment>
  </enumValues>
  <enumValues>
    <name>А4</name>
    <comment>210×297 (мм)</comment>
  </enumValues>
  <enumValues>
    <name>А5</name>
    <comment>148×210 (мм)</comment>
  </enumValues>
  <enumValues>
    <name>Другой</name>
    <comment>Другой</comment>
  </enumValues>
</mdclass:Enum>

UKS/src/InformationRegisters/ЖурналОтпечатаныхЛистов/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустой() Тогда
		Запись.ЦветПечати = Перечисления.ЦветПечати.ЧерноБелый;
		Запись.РазмерЛиста = Перечисления.РазмерыЛиста.А4;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура КомандаПерейтиПоАдресуНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура КомандаПерейтиПоАдресу(Команда)
	КомандаПерейтиПоАдресуНаСервере();
КонецПроцедуры

&НаСервере
Функция ПолучитьИПАдрес(Оборудование)
	
	ОбъектОборудование = Оборудование.ПолучитьОбъект();
	Возврат ОбъектОборудование.ИПАдрес;
	
КонецФункции

&НаКлиенте
Процедура ИПАдресНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПерейтиПоНавигационнойСсылке("http://"+СокрЛП(ПолучитьИПАдрес(Запись.Оборудование)));
	
КонецПроцедуры
